Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE064.PIC
      <edc:SFRDef edc:_addr="0x1F810400" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn------------------------" edc:cname="IPC44" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000------------------------" edc:name="IPC44" edc:nzwidth="32" edc:por="---00000------------------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="I2C3BIS" edc:desc="" edc:mask="0x3" edc:name="I2C3BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3BIP" edc:desc="" edc:mask="0x7" edc:name="I2C3BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810410" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC45" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC45" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C3SIS" edc:desc="" edc:mask="0x3" edc:name="I2C3SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3SIP" edc:desc="" edc:mask="0x7" edc:name="I2C3SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C3MIS" edc:desc="" edc:mask="0x3" edc:name="I2C3MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C3MIP" edc:desc="" edc:mask="0x7" edc:name="I2C3MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA4IS" edc:desc="" edc:mask="0x3" edc:name="DMA4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA4IP" edc:desc="" edc:mask="0x7" edc:name="DMA4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA5IS" edc:desc="" edc:mask="0x3" edc:name="DMA5IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA5IP" edc:desc="" edc:mask="0x7" edc:name="DMA5IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810420" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC46" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC46" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DMA6IS" edc:desc="" edc:mask="0x3" edc:name="DMA6IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA6IP" edc:desc="" edc:mask="0x7" edc:name="DMA6IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DMA7IS" edc:desc="" edc:mask="0x3" edc:name="DMA7IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DMA7IP" edc:desc="" edc:mask="0x7" edc:name="DMA7IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="DATAEEIS" edc:desc="" edc:mask="0x3" edc:name="DATAEEIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="DATAEEIP" edc:desc="" edc:mask="0x7" edc:name="DATAEEIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="CAN3IS" edc:desc="" edc:mask="0x3" edc:name="CAN3IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN3IP" edc:desc="" edc:mask="0x7" edc:name="CAN3IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810430" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---------------------------nnnnn" edc:cname="IPC47" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---------------------------00000" edc:name="IPC47" edc:nzwidth="32" edc:por="---------------------------00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="CAN4IS" edc:desc="" edc:mask="0x3" edc:name="CAN4IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="CAN4IP" edc:desc="" edc:mask="0x7" edc:name="CAN4IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810440" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn----------------" edc:cname="IPC48" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000----------------" edc:name="IPC48" edc:nzwidth="32" edc:por="---00000---00000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="8"/>
            <edc:AdjustPoint edc:offset="8"/>
            <edc:SFRFieldDef edc:cname="I2C4BIS" edc:desc="" edc:mask="0x3" edc:name="I2C4BIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4BIP" edc:desc="" edc:mask="0x7" edc:name="I2C4BIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="I2C4SIS" edc:desc="" edc:mask="0x3" edc:name="I2C4SIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4SIP" edc:desc="" edc:mask="0x7" edc:name="I2C4SIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810450" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC49" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC49" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="I2C4MIS" edc:desc="" edc:mask="0x3" edc:name="I2C4MIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="I2C4MIP" edc:desc="" edc:mask="0x7" edc:name="I2C4MIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC10EIS" edc:desc="" edc:mask="0x3" edc:name="IC10EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC10EIP" edc:desc="" edc:mask="0x7" edc:name="IC10EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC10IS" edc:desc="" edc:mask="0x3" edc:name="IC10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC10IP" edc:desc="" edc:mask="0x7" edc:name="IC10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC10IS" edc:desc="" edc:mask="0x3" edc:name="OC10IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC10IP" edc:desc="" edc:mask="0x7" edc:name="OC10IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810460" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC50" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC50" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC11EIS" edc:desc="" edc:mask="0x3" edc:name="IC11EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC11EIP" edc:desc="" edc:mask="0x7" edc:name="IC11EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC11IS" edc:desc="" edc:mask="0x3" edc:name="IC11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC11IP" edc:desc="" edc:mask="0x7" edc:name="IC11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC11IS" edc:desc="" edc:mask="0x3" edc:name="OC11IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC11IP" edc:desc="" edc:mask="0x7" edc:name="OC11IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC12EIS" edc:desc="" edc:mask="0x3" edc:name="IC12EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC12EIP" edc:desc="" edc:mask="0x7" edc:name="IC12EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810470" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC51" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC51" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC12IS" edc:desc="" edc:mask="0x3" edc:name="IC12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC12IP" edc:desc="" edc:mask="0x7" edc:name="IC12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC12IS" edc:desc="" edc:mask="0x3" edc:name="OC12IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC12IP" edc:desc="" edc:mask="0x7" edc:name="OC12IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC13EIS" edc:desc="" edc:mask="0x3" edc:name="IC13EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC13EIP" edc:desc="" edc:mask="0x7" edc:name="IC13EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC13IS" edc:desc="" edc:mask="0x3" edc:name="IC13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC13IP" edc:desc="" edc:mask="0x7" edc:name="IC13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810480" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC52" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC52" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="OC13IS" edc:desc="" edc:mask="0x3" edc:name="OC13IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC13IP" edc:desc="" edc:mask="0x7" edc:name="OC13IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC14EIS" edc:desc="" edc:mask="0x3" edc:name="IC14EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC14EIP" edc:desc="" edc:mask="0x7" edc:name="IC14EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC14IS" edc:desc="" edc:mask="0x3" edc:name="IC14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC14IP" edc:desc="" edc:mask="0x7" edc:name="IC14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC14IS" edc:desc="" edc:mask="0x3" edc:name="OC14IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC14IP" edc:desc="" edc:mask="0x7" edc:name="OC14IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F810490" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC53" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC53" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC15EIS" edc:desc="" edc:mask="0x3" edc:name="IC15EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC15EIP" edc:desc="" edc:mask="0x7" edc:name="IC15EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC15IS" edc:desc="" edc:mask="0x3" edc:name="IC15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC15IP" edc:desc="" edc:mask="0x7" edc:name="IC15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC15IS" edc:desc="" edc:mask="0x3" edc:name="OC15IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC15IP" edc:desc="" edc:mask="0x7" edc:name="OC15IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="IC16EIS" edc:desc="" edc:mask="0x3" edc:name="IC16EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC16EIP" edc:desc="" edc:mask="0x7" edc:name="IC16EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8104A0" edc:_begin="0x0" edc:_end="0x940" edc:_modsrc="DOS-02481_WACJ_int_evic_v3.Module" edc:_refcount="1" edc:access="---nnnnn---nnnnn---nnnnn---nnnnn" edc:cname="IPC54" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="---00000---00000---00000---00000" edc:name="IPC54" edc:nzwidth="32" edc:por="---00000---00000---00000---00000" edc:portals="CLR SET INV" ltx:memberofperipheral="INT">
        <edc:AliasList/>
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="IC16IS" edc:desc="" edc:mask="0x3" edc:name="IC16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="IC16IP" edc:desc="" edc:mask="0x7" edc:name="IC16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="OC16IS" edc:desc="" edc:mask="0x3" edc:name="OC16IS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="OC16IP" edc:desc="" edc:mask="0x7" edc:name="OC16IP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3EIS" edc:desc="" edc:mask="0x3" edc:name="SPI3EIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3EIP" edc:desc="" edc:mask="0x7" edc:name="SPI3EIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIS" edc:desc="" edc:mask="0x3" edc:name="SPI3RXIS" edc:nzwidth="2"/>
            <edc:SFRFieldDef edc:cname="SPI3RXIP" edc:desc="" edc:mask="0x7" edc:name="SPI3RXIP" edc:nzwidth="3"/>
            <edc:AdjustPoint edc:offset="3"/>
          </edc:SFRMode>
          <edc:SFRMode edc:id="LT.0">
            <edc:SFRFieldDef edc:cname="w" edc:desc="" edc:mask="0xffffffff" edc:name="w" edc:nzwidth="32"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
