Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-GP_DFP/1.0.39/edc/PIC32MK1024GPE064.PIC
      <edc:SFRDef edc:_addr="0x1F8873D0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----------nnnnnn----------------" edc:cname="ADCEIEN2" edc:desc="" edc:impl="0x3f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------000000----------------" edc:name="ADCEIQEN2" edc:nzwidth="32" edc:por="----------000000----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIEN48" edc:mask="0x1" edc:name="EIEN48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN49" edc:mask="0x1" edc:name="EIEN49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN50" edc:mask="0x1" edc:name="EIEN50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN51" edc:mask="0x1" edc:name="EIEN51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN52" edc:mask="0x1" edc:name="EIEN52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIEN53" edc:mask="0x1" edc:name="EIEN53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873E0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----rrrr----rrrrrrrrrrrrrrrrrrrr" edc:cname="ADCEISTAT1" edc:desc="" edc:impl="0xf0fffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----0000----00000000000000000000" edc:name="ADCEISTAT1" edc:nzwidth="32" edc:por="----0000----00000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="EIRDY0" edc:mask="0x1" edc:name="EIRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY1" edc:mask="0x1" edc:name="EIRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY2" edc:mask="0x1" edc:name="EIRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY3" edc:mask="0x1" edc:name="EIRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY4" edc:mask="0x1" edc:name="EIRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY5" edc:mask="0x1" edc:name="EIRDY5" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY6" edc:mask="0x1" edc:name="EIRDY6" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY7" edc:mask="0x1" edc:name="EIRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY8" edc:mask="0x1" edc:name="EIRDY8" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY9" edc:mask="0x1" edc:name="EIRDY9" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY10" edc:mask="0x1" edc:name="EIRDY10" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY11" edc:mask="0x1" edc:name="EIRDY11" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY12" edc:mask="0x1" edc:name="EIRDY12" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY13" edc:mask="0x1" edc:name="EIRDY13" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY14" edc:mask="0x1" edc:name="EIRDY14" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY15" edc:mask="0x1" edc:name="EIRDY15" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY16" edc:mask="0x1" edc:name="EIRDY16" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY17" edc:mask="0x1" edc:name="EIRDY17" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY18" edc:mask="0x1" edc:name="EIRDY18" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY19" edc:mask="0x1" edc:name="EIRDY19" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY24" edc:mask="0x1" edc:name="EIRDY24" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY25" edc:mask="0x1" edc:name="EIRDY25" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY26" edc:mask="0x1" edc:name="EIRDY26" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY27" edc:mask="0x1" edc:name="EIRDY27" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F8873F0" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----------nnnnnn----------------" edc:cname="ADCEISTAT2" edc:desc="" edc:impl="0x3f0000" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----------uuuuuu----------------" edc:name="ADCEISTAT2" edc:nzwidth="32" edc:por="----------xxxxxx----------------" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="3"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="EIRDY48" edc:mask="0x1" edc:name="EIRDY48" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY49" edc:mask="0x1" edc:name="EIRDY49" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY50" edc:mask="0x1" edc:name="EIRDY50" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY51" edc:mask="0x1" edc:name="EIRDY51" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY52" edc:mask="0x1" edc:name="EIRDY52" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="EIRDY53" edc:mask="0x1" edc:name="EIRDY53" edc:nzwidth="0x1"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:SFRDef edc:_addr="0x1F887400" edc:_begin="0x230" edc:_end="0x280" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="22" edc:access="----nnnnn-nnnnnnr-rrrrrrn-nnnnnn" edc:cname="ADCANCON" edc:desc="" edc:impl="0xfbfbfbf" edc:isindirect="false" edc:isvolatile="true" edc:mclr="----00000-u000000-0000000-000000" edc:name="ADCANCON" edc:nzwidth="32" edc:por="----00000-x000000-0000000-000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="ANEN0" edc:mask="0x1" edc:name="ANEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN1" edc:mask="0x1" edc:name="ANEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN2" edc:mask="0x1" edc:name="ANEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN3" edc:mask="0x1" edc:name="ANEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN4" edc:mask="0x1" edc:name="ANEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="ANEN5" edc:mask="0x1" edc:name="ANEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="ANEN7" edc:mask="0x1" edc:name="ANEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY0" edc:mask="0x1" edc:name="WKRDY0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY1" edc:mask="0x1" edc:name="WKRDY1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY2" edc:mask="0x1" edc:name="WKRDY2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY3" edc:mask="0x1" edc:name="WKRDY3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY4" edc:mask="0x1" edc:name="WKRDY4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKRDY5" edc:mask="0x1" edc:name="WKRDY5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="1"/>
            <edc:SFRFieldDef edc:cname="WKRDY7" edc:mask="0x1" edc:name="WKRDY7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN0" edc:mask="0x1" edc:name="WKIEN0" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN1" edc:mask="0x1" edc:name="WKIEN1" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN2" edc:mask="0x1" edc:name="WKIEN2" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN3" edc:mask="0x1" edc:name="WKIEN3" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN4" edc:mask="0x1" edc:name="WKIEN4" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN5" edc:mask="0x1" edc:name="WKIEN5" edc:nzwidth="0x1"/>
            <edc:AdjustPoint edc:offset="0x1"/>
            <edc:SFRFieldDef edc:cname="WKIEN7" edc:mask="0x1" edc:name="WKIEN7" edc:nzwidth="0x1"/>
            <edc:SFRFieldDef edc:cname="WKUPCLKCNT" edc:mask="0xf" edc:name="WKUPCLKCNT" edc:nzwidth="0x4"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
      <edc:AdjustPoint edc:_addr="0x1F887410" edc:offset="0x1F0"/>
      <edc:SFRDef edc:_addr="0x1F887600" edc:_begin="0x320" edc:_end="0x680" edc:_modsrc="DOS-02508_adc_sar_ctrl_upb_v1_PIC32MK.Module" edc:_refcount="23" edc:access="nnnnnnnnnnnnnnnnnnnnnnnnnnnnnnnn" edc:cname="ADCDATA0" edc:desc="" edc:impl="0xffffffff" edc:isindirect="false" edc:isvolatile="true" edc:mclr="00000000000000000000000000000000" edc:name="ADCDATA0" edc:nzwidth="32" edc:por="00000000000000000000000000000000" edc:portals="CLR SET INV" ltx:memberofperipheral="ADCHS">
        <edc:SFRModeList>
          <edc:SFRMode edc:id="DS.0">
            <edc:SFRFieldDef edc:cname="DATA" edc:mask="0xffffffff" edc:name="DATA" edc:nzwidth="0x20"/>
          </edc:SFRMode>
        </edc:SFRModeList>
      </edc:SFRDef>
